{
  "basics": {
    "name": "Jason Livesay",
    "email": "ithkuil@gmail.com",
    "phone": "619-550-8206",
    "label": "Programmer",
    "location": {
      "address": "2181 Benning Way",
      "postalCode": "TX 76177",
      "region": "Texas",
      "city": "Ft. Worth",
      "countryCode": "US"
    },
    "profiles": [
      {
        "network": "github",
        "username": "runvnc",
        "url": "https://github.com/runvnc"
      }
    ]
  },
    "skills": [{
      "name": "Software Development",
      "keywords": [ "HTML5", "Node.js", "Docker", "JavaScript", "CofeeScript", "ToffeeScript", "bash", "AWS", "redis", "Nim" ]
      }
    ],
  "work": [
    {
      "position": "Contract Programmer",
      "company": "Serious Mumbo, Inc.",
      "startDate": "2014-10-01",
      "summary": "Encrypted backup, help with LED display, minor UI updates, and integration tests for home email server product  (Node.js, JavaScript, some Angular JS, some C, some bash)"
    },
    {
      "position": "Founder",
      "company": "oic.io",
      "startDate": "2014-02-01",
      "summary": "Developing an IaaS product built around Docker containers including features such as: auto-running and linking dependency containers, auto nginx reverse proxy and DNS records, built-in VPN for linking containers across data centers, domain registration, and simple REST-command-line interface.  (Node.js, ToffeeScript, redis, Docker, bash, Bootstrap, CSS)"
    },
    {
      "position": "Contract Programmer",
      "company": "Talking Pet, Inc.",
      "startDate": "2011-02-01",
      "endDate": "2014-04-01",
      "summary": "Replace the AP Electronic News Production System at the Colbert Report with a Node.js-based JavaScript-CoffeeScript web application built on top of Etherpad Lite.  Configure server hardware and software, virtual private servers-containers. (JavaScript, Node.js, ToffeeScript, CoffeeScript, Rhino, redis, Docker, bash, elasticsearch, etherpad, Slickgrid)"
    },
    {
      "position": "Contract Programmer",
      "company": "LocationSmart",
      "startDate": "2013-04-01",
      "endDate": "2013-11-01",
      "summary": "Lay the foundation (core modules, configuration management tool) to replace a PHP-IT outsource-based location API product with a Node.js-AWS system. (Node.js, Mocha, AngularJS, ToffeeScript, EC2, SQS-SNS.)"
    },
    {
      "position": "Contract Programmer",
      "company": "JFORCES, LLC",
      "startDate": "2012-08-01",
      "endDate": "2013-02-01",
      "summary": "3D satellite visualization for NASA ADR (Active Debris Removal) Program - JFORCES (Joint Forces Operational Readiness Combat Effectiveness System) built with Three.js, Node.js and CoffeeScript (and some C)"
    },
    {
      "position": "Founder",
      "company": "Cure",
      "startDate": "2011-12-01",
      "summary": "Created the Cure service to facilitate deployment of virtual private servers preconfigured with Node.JS, MongoDB, redis etc."
    },
    {
      "position": "Contract Programmer",
      "company": "Coseo Properties",
      "startDate": "2010-08-01",
      "endDate": "2012-02-01",
      "summary": "Designed, developed and maintained a real estate database application built on MindTouch DekiWiki, PHP, jQuery and MySQL."
    },
    {
      "position": "Contract Programmer",
      "company": "Rief Media",
      "startDate": "2008-03-01",
      "endDate": "2010-08-01",
      "summary": "Designed, developed, and maintained PHP, mySQL, JavaScript, ActionScript, WordPress and Joomla web applications and sites.  Front end coding and database design.  Administered VPS."
    },
    {
      "position": "Contract Programmer",
      "company": "Tapestry Solutions",
      "startDate": "2007-08-01",
      "endDate": "2008-01-01",
      "highlights": [
        "Implemented core requirements of the Microsoft Fluent User Interface (ribbon) (.NET 3.0 - C# - XAML - WPF (Windows Presentation Foundation) - Expression Design - Expression Blend - Visual Studio 2008)",
        "Created login and new user entry components for the Scopes DOD web application (ASP.NET 2.0 - C# )",
        "Front end for instant messaging, user messaging (e-mail), document explorer and status board (data entry-display) (C# - XAML - WPF - asynchronous programming)"
      ]
    },
    {
      "position": "Contract Programmer",
      "company": "HDR, Inc.",
      "startDate": "2005-05-01",
      "endDate": "2007-08-01",
      "summary": "Worked on a small team developing maintenance planning and scheduling software for the San Diego Metropolitan Wastewater Department. Gathered requirements, designed classes, created forms, queries and reports (UML - VB.NET - Oracle PL-SQL - Crystal Reports - ESRI ArcEngine).",
      "highlights": [
        "Built a simple ASP.NET application for generating and maintaining data access layer classes (CodeSmith, C#)",
        "Urged adoption of updated formal methodology including short iterations and unit testing."
      ]
    },
    {
      "position": "Contract Developer",
      "company": "Self",
      "startDate": "2005-01-01",
      "highlights": [
        "for B. Hewitt: Film development lead tracker.  Angular JS, Node.js, CoffeeScript",
        "for Salvania: implement Oracle and EMC back-end for QuickFile document storage solution (C++-PHP)",
        "for B. Pollack and u-broadcast.com: object-oriented IRC library and client (ActionScript 3, Flash CS3, XML)",
        "for Salvania: helped convert C# Blogosphere visualization to C++ (C#-C++-OpenGL-multithreading-wxWidgets)",
        "for newlocaldirect.com: web site image capture tool (C#-.NET)",
        "for Zeruno Solutions: Created reports and forms for employee, payroll and other modules of small business applications (VB.NET-SQL Server-Tier Developer); converted Crystal Reports from push to pull model to optimize performance; RTF-based template editor-document generator-document catalog for local Procuradura General de la Repblica office (VB.NET - C# - UserControl - SQL Server)"
      ]
    },
    {
      "position": "Image Design Developer (contract)",
      "company": "Intuit, Inc.",
      "startDate": "2004-05-01",
      "endDate": "2005-01-01",
      "summary": "Updated tax forms, user interface screens, and (SGML) help files for TurboTax and related products using Formwriter form editing software and PVCS source control",
      "highlights": [
        "Architect of solution that automatically compares PDF documents to SGML help files. Collaborated with other seasonal developers to implement solution in the form of PaMUT (Proof and Markup Tool). Manual word-for-word comparisons that took days were reduced to a matter of seconds. Estimated 500-800 hours saved in last two months of season. (C#-.NET, C++-ATL-COM)",
        "Created tool to monitor state department of revenue web sites for updates to PDF tax publications (C#-.NET, Quickbase, XML-XPath)",
        "Wrote database query tool for retrieving developers corresponding to modules and sending email distributions (Quickbase, Javascript, XML-XPath, VBA)",
        "Implemented tool for updating IDG tax development assignments replacing ten long data entry screens with a single three field screen (Quickbase, Javascript, XML-XPath)"
      ]
    },
    {
      "position": "Administrative and data entry positions",
      "company": "Appleone Employment",
      "startDate": "2003-05-01",
      "endDate": "2004-05-01",
      "highlights": [
        "Reduced data entry volume for disclosure package creation by a factor of four at California Coast Credit Union by converting mail merge to use shared data source with field codes (MS Word-Excel)",
        "At Household Automotive, created MS Word macro to automate Internet Explorer for printing account data from web application; increased process efficiency by approximately 150-300% and cut staffing requirements (VBA)",
        "Set-up automotive finance packages by entering loan application information into AS400 system",
        "Work with vendor managers to handle problem agencies. Train temporary employees in account review and package printing process. Receive ACD line calls for liens & impounds department; document incoming issues in debt management application and direct calls to appropriate staff or department."
      ]
    },
    {
      "position": "Developer",
      "company": "alita.sourceforge.net",
      "startDate": "2003-04-01",
      "endDate": "2003-05-01",
      "summary": "3D graphics simulation of six-legged robot (C++, OpenGL, wxWidgets).  Web research related to robotics simulation, inverse kinematics, rigid body dynamics w- friction"
    },
    {
      "position": "Consultant",
      "company": "Genway Biotech",
      "startDate": "2003-01-01",
      "endDate": "2003-02-01",
      "summary": "Solution for cross-referencing gene sequences. C & PHP code for parsing XML output of BLAST queries.  Telephone support for installing and configuring Linux software. Helped correct internet domain name registration problem"
    },
    {
      "position": "Contract Programmer",
      "company": "PCH Systems, Inc.",
      "startDate": "2002-01-01",
      "endDate": "2002-06-01",
      "summary": "Web and desktop design and development",
      "highlights": [
        "account login, file manager (ASP, ActiveX Data Objects (ADO), MS Access)",
        "Inventory and order management application (VB 6, ADO, MS Access)",
        "Questionnaire for psychological evaluation with MS Word mail-merge (ADO, VB 6, MS Access)",
        "Utility to load investment data from HTML into database (VB 6, ADO, SQL Server 7.0)"
      ]
    },
    {
      "position": "Word Processing Operator",
      "company": "Various law firms",
      "startDate": "1998-06-01",
      "endDate": "2001-11-01",
      "summary": "Prestigious international law firms: Sullivan & Cromwell, Cahill Gordon & Reindel, Allen & Overy, Wachtell Lipton Rosen & Katz",
      "highlights": [
        "Input, style and revise complex documents in legal word processing centers (MS Word 97-2000, WordPerfect 8.0, IManage, DOCS Open)",
        "Telephone, filing and correspondence for partners in the New York office of a top-tier international law firm (Allen & Overy)",
        "Download room-extension info for personnel from intranet web page and format for hard copy (VBA-Flex-Awk)"
      ]
    }
  ]
}
